; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_3 ?v4 - type_2 ?v1 - type_3)
 	      (pred_4 ?v6 - object ?v1 - type_3)
	      (pred_2 ?v4 - type_2 ?v5 - type_1)
	      (pred_1 ?v4 - type_2 ?v6 - object ?v5 - type_1))

   (:action op_1
       :parameters  (?v4 - type_2 ?v8 ?v3 - type_3)
       :precondition (and  (pred_3 ?v4 ?v8))
       :effect (and  (pred_3 ?v4 ?v3)
		     (not (pred_3 ?v4 ?v8))))

   (:action op_3
       :parameters (?v4 - type_2 ?v2 - object ?v7 - type_3 ?v5 - type_1)
       :precondition  (and  (pred_4 ?v2 ?v7) (pred_3 ?v4 ?v7) (pred_2 ?v4 ?v5))
       :effect (and (pred_1 ?v4 ?v2 ?v5)
		    (not (pred_4 ?v2 ?v7)) 
		    (not (pred_2 ?v4 ?v5))))

   (:action op_2
       :parameters (?v4 - type_2 ?v2 - object ?v7 - type_3 ?v5 - type_1)
       :precondition  (and  (pred_1 ?v4 ?v2 ?v5) (pred_3 ?v4 ?v7))
       :effect (and (pred_4 ?v2 ?v7)
		    (pred_2 ?v4 ?v5)
		    (not (pred_1 ?v4 ?v2 ?v5)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_02 obj_09 - type_2
obj_07 obj_08 obj_05 obj_12 - type_1
obj_06 obj_04 obj_10 - type_3
obj_03 obj_11 obj_01 - object)
(:init
(pred_3 obj_02 obj_06)
(pred_2 obj_02 obj_07)
(pred_2 obj_02 obj_08)
(pred_3 obj_09 obj_06)
(pred_2 obj_09 obj_05)
(pred_2 obj_09 obj_12)
(pred_4 obj_03 obj_10)
(pred_4 obj_11 obj_10)
(pred_4 obj_01 obj_04)
)
(:goal
(and
(pred_4 obj_03 obj_10)
(pred_4 obj_11 obj_04)
(pred_4 obj_01 obj_06)
)
)

(:constraints
  (always (not (pred_3 obj_02 obj_10)))
)
)

; plan
1. (op_1 obj_02 obj_06 obj_04)
   deleted: (pred_3 obj_02 obj_06)
   added: (pred_3 obj_02 obj_04)
   goals met: 1 of 3
2. (op_1 obj_09 obj_06 obj_10)
   deleted: (pred_3 obj_09 obj_06)
   added: (pred_3 obj_09 obj_10)
   goals met: 1 of 3
3. (op_3 obj_09 obj_11 obj_10 obj_12)
   deleted: (pred_4 obj_11 obj_10) (pred_2 obj_09 obj_12)
   added: (pred_1 obj_09 obj_11 obj_12)
   goals met: 1 of 3
4. (op_3 obj_02 obj_01 obj_04 obj_08)
   deleted: (pred_4 obj_01 obj_04) (pred_2 obj_02 obj_08)
   added: (pred_1 obj_02 obj_01 obj_08)
   goals met: 1 of 3
5. (op_1 obj_09 obj_10 obj_04)
   deleted: (pred_3 obj_09 obj_10)
   added: (pred_3 obj_09 obj_04)
   goals met: 1 of 3
6. (op_1 obj_02 obj_04 obj_06)
   deleted: (pred_3 obj_02 obj_04)
   added: (pred_3 obj_02 obj_06)
   goals met: 1 of 3
7. (op_2 obj_09 obj_11 obj_04 obj_12)
   deleted: (pred_1 obj_09 obj_11 obj_12)
   added: (pred_4 obj_11 obj_04) (pred_2 obj_09 obj_12)
   goals met: 2 of 3
8. (op_2 obj_02 obj_01 obj_06 obj_08)
   deleted: (pred_1 obj_02 obj_01 obj_08)
   added: (pred_4 obj_01 obj_06) (pred_2 obj_02 obj_08)
   goals met: 3 of 3
